Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_1.tmx
Source language: de
Languages: en

source: Metallische Türfeststeller
en: Door holding devices of metal

source: Doppelverglasungstafeln aus Metall
en: Double glazing panels (Metal -)

source: Schraubbolzen aus Metall
en: Screw bolts of metal

source: Trennwände aus Metall [ausgenommen Möbelteile]
en: Shelf dividers of metal [other than parts of furniture]

source: Formen aus Metall
en: Metal mouldings

source: Betongießformen aus Metall
en: Metal casting forms for concrete

source: Halbfertigerzeugnisse aus Kupfer und dessen Legierungen
en: Semi-finished articles of copper or its alloys

source: Metallteile für architektonische Zwecke
en: Architectural metalwork for use in building

source: Gepanzerte Bankanlagen aus Metall
en: Armoured banking installations of metal

source: Kunstgegenstände aus unedlem Metallguss
en: Artistic castings of common metal

source: Trophäen aus unedlen Metallen
en: Trophies of common metal

source: Muttern [Eisenwaren]
en: Nuts [metal hardware]

source: Hausnummern aus Metall
en: Metal house numbers

source: Lagerfässer aus Metall
en: Metal storage drums

source: Aufroller aus Metall [nicht maschinell] zur Kettenlagerung
en: Reels of metal [non-mechanical] for storing chains

source: Lagerbehälter aus Metall für Werkzeuge [leer]
en: Tool storage containers of metal [empty]

source: Terrassentüren [metallumrandet]
en: Patio doors (Metal framed -)

source: Geflügelkäfige aus Metall
en: Poultry cages of metal

source: Schnell auslösende Kettenstopper aus Metall
en: Quick release chain stoppers [metal]

source: Geländerhalterungen aus Metall
en: Railing holders of metal

source: Mobile Unterkünfte aus Metall
en: Mobile accommodation [metal]

source: Modulare Metallbauten
en: Modular metallic structures

source: Steckverbinder aus Metall für Bodenbeläge und Bodenbalken
en: Metal connectors for decking and decking joists

source: Flanschen [Schellen] aus Metall
en: Flanges of metal [collars]

source: Metallformen für das Formen von Zementprodukten
en: Metal moulds for forming cement products

source: Leiterstützen aus Metall
en: Ladder supports of metal

source: Beschichtete Metalle
en: Laminated metals

source: Draht für Seile
en: Wire for ropes

source: Balken aus Metall oder Stahl
en: Joists of iron or steel

source: Lötdraht mit eingearbeitetem Flussmittel
en: Soldering wire with built-in flux

source: Schalldämmende Metallkonstruktionen für Gebäude
en: Sound absorbing structures of metal for buildings

source: Jalousien aus Metall
en: Jalousies of metal

source: Außenrollläden aus Metall
en: Outdoor blinds of metal

source: Schiebetürrollen aus Metall
en: Runners of metal for sliding doors

source: Schubladengriffe aus Metall
en: Drawer handles of metal

source: Rohrleitungen [nicht elektrisch] aus Metall
en: Ducting conduits (Non-electric -) of metal

source: Leitungen aus Metall für Gasleitungsrohre
en: Ducts made of metal for trunking conduits for gases

source: Rohre aus Metall als Hauptleitungen für Flüssigkeiten
en: Ducts made of metal for trunking conduits for liquids

source: Düsen aus Metall
en: Nozzles of metal

source: Masten aus Metall [außer Antennen oder für Wasserfahrzeuge]
en: Metal masts [other than aerials or for watercraft]

source: Mittelstangen aus Metall für Treppen
en: Centre poles of metal for staircases

source: Keramikverstärktes Aluminium
en: Ceramic reinforced aluminium

source: Wolfram
en: Tungsten

source: Gerüste [Bauwerk] aus Metall
en: Gantries [structures] of metal

source: Grabdenkmäler aus Metall
en: Monuments of metal for tombs

source: Ankerbuchsen aus Metall
en: Anchor bushings of metal

source: Eloxierte Metalle
en: Anodised metals

source: Bögen aus Metall zum Stützen von Pflanzen
en: Arches of metallic materials for supporting plants

source: Schutzleisten aus Metall
en: Crash rails of metal

source: Metallflaschen für Tiefsttemperaturflüssigkeiten
en: Cylinders of metal for cryogenic liquid

source: Metallkäfige für wilde Tiere
en: Metal cages for wild animals

source: Wandverkleidungsteile aus Metall
en: Wall linings of metal for building

source: Seilscheiben aus Metall [ausgenommen für Maschinen]
en: Pulleys of metal, other than for machines

source: U-Bolzen aus Metall
en: U-bolts of metal

source: Fahrzeugrampen aus Metall
en: Vehicle ramps of metal

source: Lüftungsgitter aus Metall zum Einbau in Türen
en: Ventilation grilles of metal for fitting in doors

source: Lamellengitter aus Metall
en: Louvres made of metal

source: Latten aus Metall
en: Laths of metal

source: Polsterungsnägel aus Metall
en: Metal upholstery tacks

source: Poller aus Metall
en: Metal bollards

source: Balustraden aus Metall
en: Balustrades of metal

source: Verbindungsstäbe aus Metall
en: Bar connectors of metal

source: Drahtseile für Abspannzwecke
en: Metal cables for guying purposes

source: Transportable Gewächshäuser aus Metall
en: Greenhouses of metal, transportable

source: Bindedraht aus Metall für landwirtschaftliche Zwecke
en: Binding thread of metal for agricultural purposes

source: Ladepaletten aus Metall
en: Loading pallets of metal

source: Fensterrollen aus Metall
en: Metal window pulleys

source: Nicht automatische Metalldrehkreuze
en: Non-automatic metal turnstiles

source: Rohre aus rostfreiem Stahl
en: Tubes of stainless steel

source: Rauchabzüge [Entlüftungen] aus Metall
en: Smoke outlets [vents] of metal

source: Gerüste [Metallkonstruktionen]
en: Towers [metal structures]

source: Transportcontainer aus Metall
en: Containers of metal for transport

source: Zugangsplattformen [Gerüste] aus Metall
en: Access platforms [scaffolding] of metal

source: Metallgitter für Sicherheitszwecke
en: Grills of metal for safety purposes

source: Schwimmdocks aus Metall
en: Floating metal docks

source: Zink zum Hartlöten
en: Spelter for brazing

source: Federn als Metallwaren für Polsterwaren
en: Springs being metal hardware for upholstery

source: Briefkastendeckel aus Metall
en: Letter-box covers of metal

source: Deckenverkleidung aus Metall
en: Linings (Metal -) for ceilings

source: Verarbeitete Metallerze
en: Processed metal ores

source: Profilierte Metallprofile [Halbfabrikate]
en: Profiled metal sections [semi-finished]

source: Richtungsschilder aus Metall für Straßen [nicht leuchtend, nicht mechanisch]
en: Directional signage of metal for roads [non-luminous, non-mechanical]

source: Türpuffer aus Metall
en: Door buffers of metal

source: Dekorative Actionfiguren aus unedlem Metall
en: Action figures (Decorative -) of common metal

source: Adapter aus Metall für Rohre
en: Adaptors for pipes [metal]

source: Adressenanhänger aus Metall für Tiere
en: Address holders (Metal -) for animals

source: Fensterbeschläge aus Metall
en: Fittings of metal for windows

source: Kupfererze
en: Copper ores

source: Klauenkettenstopper aus Metall
en: Claw-chain stoppers of metal

source: Pyrophore Metalle
en: Pyrophoric metals

source: Tantal [Metall]
en: Tantalum [metal]

source: Telegrafenmasten aus Metall
en: Telegraph posts of metal

source: Metallbolzen [Befestigungen]
en: Metal bolts [fasteners]

source: Schweißbleche aus Metall
en: Metal plates for welding

source: Metallkörbchen zur Sicherung von Sektflaschenkorken
en: Muzzles for clamping corks to sparkling wine bottles

source: Klemmschnallen aus Metall
en: Cam buckle tighteners of metal

source: Schwimmdocks aus Metall für Jachthäfen
en: Floating docks of metal for marinas

source: Wandverkleidungskacheln aus Metall
en: Wall covering tiles of metal

source: Radkrallen aus Metall [nicht als Diebstahlschutz für Fahrzeuge]
en: Wheel clamps of metal [other than anti-theft for vehicles]

source: Fensterkörbe aus Metall
en: Window baskets of metal

source: Türhaken aus Metall
en: Hooks (Door -) of metal

source: Ringverschlüsse aus unedlem Metall
en: Ring closures of common metal

source: Ventile aus Metall [ausgenommen als Maschinenteile] einschließlich aus Stahllegierungen und Titan
en: Valves of metal other than parts of machines including those from alloy steel and titanium

source: Offshore-Bohrplattformen [Metall]
en: Offshore drilling platforms [metal]

source: Schienen [Gleise] aus Metall
en: Tracks [rails] of metal

source: Metallische Dachplatte
en: Roofing plate of metal

source: Vorgefertigte Modulgerüste aus Stahl
en: Modular prefabricated steel framing

source: Modulare Wandvertäfelungen aus Metall
en: Modular wall panelling of metal

source: Metallkabel zum Festmachen
en: Mooring cables of metal

source: Drehbare Rohrverbindungsstücke aus Metall
en: Rotating junctions of metal for pipes

source: Metallpfosten für Bushaltestellen
en: Posts of metal for use as bus-stops

source: Trockenbauwanddeckenleisten aus Metall
en: Drywall corner bead of metal [building materials]

source: Gitter aus Metall für Zwischendecken
en: Gratings of metal for false ceilings

source: Regelventile aus Metall [ausgenommen Maschinenteile]
en: Regulators [valves] of metal other than parts of machines

source: Figurinen aus Bronze
en: Figurines made from bronze

source: Absetzbehälter aus Metall
en: Settlement tanks of metal

source: Handläufe aus Metall für Gehwege
en: Handrails of metal for walkways

source: Schottbeschläge aus Metall [ausgenommen für Fahrzeuge]
en: Bulkhead fittings of metal [other than vehicles]

source: Buchsen aus Metall [ausgenommen als Maschinenteile]
en: Bushings of metal [other than parts of machines]

source: Luftgitter aus Metall
en: Air grilles of metal

source: Luftschleusenkammern aus Metall
en: Airlock chambers of metal

source: Türscharniere aus Metall
en: Door hinges of metal

source: Metallrahmen für Lagergestelle [ausgenommen Möbel]
en: Shelving frames of metal [other than furniture]

source: Rollgitter aus Metall
en: Shutter grilles of metal

source: Transportable Plattformen aus Metall [Gerüste]
en: Mobile platforms [scaffolding] of metal

source: Balken aus unedlem Metall für Bauzwecke
en: Beams of common metal for building

source: Blindbolzen aus Metall
en: Blind bolt fasteners of metal

source: Trophäensäulen aus unedlem Metall
en: Trophy columns of common metal

source: Gestelle aus Metall [Bauwerk]
en: Racks [structures] of metal

source: Arbeitsbühnen aus Metall [Gerüsttürme]
en: Work platforms [scaffold towers] of metal

source: Schließbleche aus Metall für Schlösser
en: Striking plates of metal for locks

source: Fesseln [Handschellen] aus Metall
en: Shackles [handcuffs] made of metal

source: Baulattformen [Tragwerke] aus Metall
en: Structural platforms [structures] of metal

source: Drahtnetze und -gewebe
en: Wire nets and gauzes

source: Bretter aus Metall für Bauzwecke mit isolierenden Eigenschaften
en: Building boards (Metal -) having insulating properties

source: Sandkästen aus Metall
en: Sand boxes of metal

source: Schiebefensterzüge aus Metall
en: Sash window pulls of metal

source: Rohrverbindungsstücke aus Metall einschließlich aus Stahllegierungen und Titan
en: Junctions of metal for pipes including those from alloy steel and titanium

source: Kastenrahmen aus Metall
en: Box frames of metal

source: Verpackungskisten in flacher Form aus Metall
en: Boxes (packaging -) in flat form [metal]

source: Kästen zum Stapeln aus Metall
en: Boxes for stacking purposes [metal]

source: Projektionswände aus Metall
en: Projection walls of metal

source: Transportable Metallpaletten
en: Mobile pallets made of metal

source: Falltüren aus Metall
en: Trap doors of metal

source: Metallspaliere zum Stützen von Pflanzen
en: Trellis (Metal -) for supporting plants

source: Draht für Litzen
en: Wire for strands

source: Plastische Gedenkpokale aus unedlem Metall
en: Commemorative statuary cups made of non-precious metal

source: Rohre aus Metall zur Aufnahme von Lüftungsleitungen
en: Ducts of metal for housing ventilation pipes

source: Ställe aus Metall
en: Stables of metal

source: Abflussstopfen aus Metall
en: Drain plugs of metal

source: Stahlerzeugnisse
en: Steel fabrications

source: Treppen aus Metall
en: Staircases of metal

source: Spannbügel aus Metall
en: Tension links of metal

source: Fensterriegel aus Metall
en: Window fasteners of metal

source: Zuganker aus Metall zur Verankerung
en: Thread of metal for tying-up purposes

source: Draht aus Metall
en: Wire of common metal

source: Bänder zum Binden aus Metall
en: Bands of metal for tying-up purposes

source: Türen, Tore, Fenster und Fensterabdeckungen aus Metall
en: Doors, gates, windows and window coverings of metal

source: Schweiß- und Lötmaterial
en: Welding and soldering materials

source: Statuen und Kunstwerke aus unedlen Metallen
en: Statues and works of art of common metals

source: Bauten und transportable Bauten aus Metall
en: Structures and transportable buildings of metal

source: Container sowie Transport- und Verpackungsgegenstände aus Metall
en: Containers, and transportation and packaging articles, of metal

source: Artikel zum Verpacken, Einwickeln und Bündeln
en: Packaging, wrapping and bundling articles

source: Tresore und Safes
en: Vaults and safes

source: Kabel, Drähte und Ketten
en: Cables, wires and chains

source: Wandfliesen aus Metall
en: Wall tiles of metal

source: Nicht elektrische Fensterschließer
en: Window closers, non-electric

source: Tritthocker aus Metall
en: Step stools of metal

source: Bänder aus unedlem Metall zur Kennzeichnung von Vögeln
en: Common metal bands for the identification of birds

source: Leitungen, Rohre und Schläuche sowie Zubehör hierfür, einschließlich Ventile, aus Metall
en: Pipes, tubes and hoses, and fittings therefor, including valves, of metal

source: Artikel zum Verpacken, Einwickeln und Bündeln, aus Metall
en: Packaging, wrapping and bundling articles, of metal

source: Spender aus Metall
en: Dispensers, of metal

source: Kabel, Drähte und Ketten aus Metall
en: Cables, wires and chains, of metal

source: Schilder sowie Informations- und Werbetafeln aus Metall
en: Signs, and information and advertising displays, of metal

source: Leitern und Gerüste aus Metall
en: Ladders and scaffolding, of metal

source: Tresore und Safes aus Metall
en: Vaults and safes, of metal

source: Dächer aus Metall mit integrierten Solarzellen
en: Roofing of metal, incorporating photovoltaic cells

source: Warmgewalzte Stahlstangen
en: Hot-rolled steel bars

source: Gezogene und polierte Metallstangen
en: Drawn and polished metal bars

source: Winkelstücke aus Metall für Möbel
en: Brackets of metal for furniture

source: Kanister aus Metall
en: Jerrycans of metal

source: Verschlussclips aus Metall für Beutel
en: Clips of metal for sealing bags

source: Falttüren aus Metall
en: Folding doors of metal

source: Profilleisten aus Metall für Bauzwecke
en: Mouldings of metal for building

source: Kaminverkleidungen aus Metall
en: Fireplace mantles of metal

source: Türschilder aus Metall
en: Doorplates of metal

source: Türen aus Metall für Geldschränke
en: Metallic doors for strongbox

source: Ankerbolzen aus Metall für Brückenverbindungen
en: Anchor bolts of metal for bridge connection

source: Markisen aus Metall [Baumaterialien]
en: Awnings of metal [building materials]

source: Faltbare Rohre aus Metall
en: Collapsible tubes of metal

source: Metallbehälter für Flüssigdünger
en: Containers of metal for liquid fertilizers

source: Metallbehälter für Flüssiggas
en: Containers of metal for liquid gas

source: Metallhalterungen für Flügelfenster
en: Fasteners of metal for casement windows

source: Bodenbleche aus Metall
en: Floor boards of metal

source: Bodenscharniere aus Metall
en: Floor hinges of metal

source: Gabionen aus Stahldrähten
en: Gabions of steel wire

source: Industrielle Wassertanks aus Metall
en: Industrial water tanks of metal

source: Außenrollläden aus Metall zur Lichtführung
en: Metal exterior roller blinds for guiding light

source: Metallbeschichtete Blattfedern [ausgenommen Maschinenteile]
en: Metal laminated leaf-springs [not machine elements]

source: Metallstopper für gewerbliche Verpackungsbehälter
en: Metal stoppers for industrial packaging containers

source: Außentüren aus Metall
en: Outer doors of metal

source: Fertiggaragen aus Metall
en: Prefabricated garages of metal

source: Strukturelle Verbindungsstücke aus Metall
en: Structural joint connectors of metal

source: Schiebefenster aus Aluminium
en: Window sashes of aluminium

source: Statuen von religiösen Ikonen, nicht aus Edelmetall
en: Statues of non-precious metal of religious icons

source: Gitter aus Metall
en: Latticework of metal

source: Dächer aus Metall
en: Roofing of metal

source: Fertighäuser [Bausätze] aus Metall
en: Prefabricated houses [kits] of metal

source: Vorgefertigte Bauten aus Metall
en: Prefabricated metal buildings

source: Fertighäuser aus Metall
en: Pre-fabricated houses of metal

source: Türbolzen aus Metall
en: Door bolts of metal

source: Flache Riegel
en: Bolts, flat

source: Hebeschlingen, aus Metall, für Lasten
en: Slings of metal for handling loads

source: Lastentraggurte aus Metall
en: Straps of metal for handling loads

source: Türpfosten aus Metall
en: Door jambs of metal

source: Türrahmen aus Metall
en: Door frames of metal

source: Flaschenkappen aus Metall
en: Bottle caps of metal

source: Flaschenverschlüsse aus Metall
en: Bottle closures of metal

source: Kaminkappen aus Metall
en: Chimney cowls of metal

source: Kaminhauben aus Metall
en: Chimney pots of metal

source: Förderpaletten aus Metall
en: Handling pallets of metal

source: Transportpaletten aus Metall
en: Transport pallets of metal

source: Aluminiumfolien
en: Aluminium foil

source: Eisenguss
en: Cast iron

source: Ambosse
en: Anvils

source: Gewalzter Stahl
en: Rolled steel

source: Nicht elektrische Metallkabel
en: Cables of metal, non-electric

source: Lötstäbe aus Metall [Hartlöten]
en: Rods of metal for brazing

source: Kabelkauschen aus Metall
en: Cable thimbles of metal

source: Grabplatten aus Metall
en: Grave slabs of metal

source: Grabtafeln aus Metall
en: Tombstone plaques of metal

source: Türklopfer aus Metall
en: Door knockers of metal

source: Figuren [Statuetten] aus unedlen Metallen
en: Figurines [statuettes] of common metal

source: Skulpturen aus unedlen Metallen
en: Sculptures of non-precious metal

source: Figuren aus unedlen Metallen
en: Figures of common metal

source: Statuen aus unedlen Metallen
en: Statues of common metal

source: Statuen aus unedlem Metall
en: Statues of non-precious metal

source: Statuetten aus unedlen Metallen
en: Figurines of non-precious metal

source: Büsten aus unedlen Metallen
en: Busts of non-precious metal

source: Titan und dessen Legierungen
en: Titanium and its alloys

source: Dosen aus Metall
en: Tins of metal

source: Konservendosen aus Metall
en: Preserving boxes of metal

source: Stacheldraht
en: Barbed wire

source: Dachstreben aus Metall
en: Metal roof trusses

source: Träger aus Metall
en: Beams of metal

source: Zaunpfähle aus Metall
en: Metal fence posts

source: Gitterstäbe aus Metall
en: Bars for metal railings

source: Kabelschellen aus Metall
en: Cable clamps of metal

source: Stromleitungsmasten aus Metall
en: Posts of metal for power lines

source: Strommasten aus Metall
en: Metal utility poles

source: Klammern [Krampen] aus Metall
en: Cramps of metal [crampons]

source: Steigeisen aus Metall
en: Crampons for climbing

source: Rohre aus Metall
en: Tubes of metal

source: Fensterrahmen aus Metall
en: Window frames of metal

source: Türbeschläge aus Metall
en: Door fittings of metal

source: Unedle Metalle und deren Legierungen
en: Common metals and their alloys

source: Haken [Kleineisenwaren]
en: Hooks [metal hardware]

source: Nicht elektrische Türklingeln aus Metall
en: Door bells of metal, non-electric

source: Baubeschläge aus Metall
en: Fittings of metal for building

source: Metallverkleidung für Bauten
en: Metal trim for buildings

source: Kleiderhaken aus Metall
en: Hat-hanging hooks of metal

source: Garderobenhaken aus Metall
en: Hooks of metal for clothes rails

source: Stehleitern aus Metall
en: Steps [ladders] of metal

source: Fässer aus Metall
en: Casks of metal

source: Tonnen aus Metall
en: Barrels of metal

source: Brückenlager [Baumaterialien] aus Metall
en: Bridge bearings [construction materials] of metal

source: Armierungsstifte aus Metall für Schalungen
en: Reinforcing pins of metal for formwork

source: Vinylbeschichtete Stahlbleche
en: Vinyl coated steel sheets

source: Vinylbeschichtete Stahlplatten
en: Vinyl coated steel plates

source: Kokillen [Gießerei]
en: Chill-moulds [foundry]

source: Gießereiformen aus Metall
en: Foundry molds [moulds] of metal

source: Lasthebebänder aus Metall
en: Load lifting straps of metal

source: Fertige Metallbauteile für Gebäudefundamente [Baumaterialien]
en: Fabricated metal components for building foundations

source: Bühnen für Musikveranstaltungen, hauptsächlich aus Metall
en: Stages for musical performances composed of primarily metal materials

source: Innenfensterläden aus Metall
en: Interior metal shutters

source: Fensterschlösser aus Metall
en: Metal locks for windows

source: Halb feuerfeste Blöcke aus Metall
en: Semi-refractory bricks of metal

source: Feuerfeste Ofenauskleidungen aus Metall
en: Refractory furnace linings of metal

source: Feuerfeste gießbare Metallmischungen
en: Refractory castable mixes of metal

source: Feuerfeste Metallziegel
en: Refractory bricks of metal

source: Feuerfeste Metallblöcke
en: Refractory blocks of metal

source: Startnummernschilder für Radrennen aus Metall
en: Bicycle racing number plates made of metal

source: Modulare Ställe aus Metall
en: Modular metal stables

source: Vorgefertigte Ställe aus Metall
en: Pre-fabricated metal stables

source: Vorgefertigte oder modulare Ställe aus Metall
en: Pre-fabricated or modular metal stables

source: Brückengeländer aus Metall
en: Metal railings for bridges

source: Bleifreie Lötmetalle für die Elektronikindustrie
en: Lead-free solders for the electronics industry

source: Schuhnägel aus Metall
en: Shoe pegs of metal

source: Absatzflecke aus Metall
en: Shoe dowels of metal

source: Verkaufsstände, hauptsächlich aus Metall
en: Vendor booths made primarily of metal

source: Mobile Metallplattformen für öffentliche Veranstaltungen
en: Portable metal risers for public performances

source: Automatische Tankhähne aus Metall
en: Non-automatic fueling nozzles of metal

source: Abgehängte Deckensysteme aus Metall, bestehend aus Platten
en: Metal suspended ceiling systems comprising panels

source: Heizkanäle aus Metall
en: Metal heating ducts

source: Leere Metallzylinder für Druckgas oder Flüssigkeiten
en: Metal cylinders for compressed gas or liquids, sold empty

source: Leere Aerosolbehälter aus Metall
en: Metal aerosol containers sold empty

source: Ortsfeste Spender aus Metall für Hundekotbeutel
en: Dispensers for dog waste bags, fixed, of metal

source: Blattmetalle oder Metalle in Pulverform für 3D-Drucker
en: Metals in foil or powder form for 3D printers

source: Türriegel aus Metall
en: Door fasteners of metal

source: Flaschenstöpsel aus Metall
en: Metal bottle stoppers

source: Geländer aus Metall für Zäune
en: Metal railings for fences

source: Geländer aus Metall für Balkone
en: Metal railings for balconies

source: Türschlösser aus Metall
en: Metal locks for doors

source: Torriegel aus Metall
en: Metal gate latches

source: Rohre aus Metall für Klimaanlagen
en: Metal air conditioning ducts

source: Silber-Nickel
en: Nickel silver

source: Bolzen aus Metall
en: Bolts of metal

source: Nicht maschinelle Schlauchhaspeln [Aufroller] aus Metall
en: Winding spools of metal, non-mechanical, for flexible hoses

source: Nicht maschinelle Schlauchhaspeln [Abroller] aus Metall
en: Reels of metal, non-mechanical, for flexible hoses

source: Stahldraht
en: Steel wire

source: Eisendraht
en: Iron wire

source: Masten aus Metall
en: Masts of metal
